Catalogs/ТипыМДРегистрируемыхВРЭМД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ТипыМДРегистрируемыхВРЭМД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>OIDКлассификатораМинздрава</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКлассификатораМинздрава</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМинздрава</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТипаМД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимаПодписьМО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимСНИЛСПациента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередаватьВИЭМК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаРуководствоПоРеализацииСЭМД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматФайлаДляРЭМД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФорматФайлаДляРЭМД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ФорматФайлаДляРЭМД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ФорматФайлаДляРЭМД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>PDF</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CDA</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТипыМДРегистрируемыхВРЭМД/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает ссылку на элемент справочника по указанным ключевым параметрам
//
// Параметры:
//  codeSystem	 - Строка	 - Значение реквизита codeSystem
//  АтрибутCode	 - Строка	 - Значение реквизита АтрибутCode
// 
// Возвращаемое значение:
//  СправочникСсылка.ТипыМДРегистрируемыхВРЭМД, Неопределено - Ссылка на найденное значение (если не найдено - Неопределено)
//
Функция НайтиПоКлючу(codeSystem, АтрибутCode) Экспорт
	Запрос_ = Новый Запрос(
		"ВЫБРАТЬ
		|	ТипыРЭМД.Ссылка
		|ИЗ
		|	Справочник.ТипыМДРегистрируемыхВРЭМД КАК ТипыРЭМД
		|ГДЕ
		|	ТипыРЭМД.OIDКлассификатораМинздрава = &codeSystem
		|	И ТипыРЭМД.КодМинздрава = &АтрибутCode"
	);
	Запрос_.УстановитьПараметр("codeSystem", codeSystem);
	Запрос_.УстановитьПараметр("АтрибутCode", АтрибутCode);
	Выборка_ = Запрос_.Выполнить().Выбрать();
	Если Выборка_.Следующий() Тогда
		Возврат Выборка_.Ссылка;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

#КонецОбласти

#Область ЗагрузкаИзНСИ

#Область ПрограммныйИнтефейс

// Функция ПрочитатьДанныеКлассификатораИзXDTO получает данные из Объекта XDTO
// и формирует таблицу значений.
//
// Параметры:
//  ОбъектXDTO     - ОбъектXDTO.
//
// Возвращаемое значение:
//  ТаблицаЗначений.
//
Функция ПрочитатьДанныеКлассификатораИзXDTO(ОбъектXDTO, ПараметрыЗагрузки) Экспорт
	
	Таблица_ = Новый ТаблицаЗначений;
	Таблица_.Колонки.Добавить("КодМинздрава", Новый ОписаниеТипов("Строка"));
	Таблица_.Колонки.Добавить("КодТипаМД", Новый ОписаниеТипов("Строка"));
	Таблица_.Колонки.Добавить("OIDКлассификатораМинздрава", Новый ОписаниеТипов("Строка"));
	Таблица_.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	Таблица_.Колонки.Добавить("НаименованиеПолное", Новый ОписаниеТипов("Строка"));
	Таблица_.Колонки.Добавить("НеобходимаПодписьМО", Новый ОписаниеТипов("Булево"));
	Таблица_.Колонки.Добавить("НеобходимСНИЛСПациента", Новый ОписаниеТипов("Булево"));
	Таблица_.Колонки.Добавить("ФорматФайлаДляРЭМД", Новый ОписаниеТипов("ПеречислениеСсылка.ФорматФайлаДляРЭМД"));
	Таблица_.Колонки.Добавить("СсылкаНаРуководствоПоРеализацииСЭМД", Новый ОписаниеТипов("Строка"));
	
	Если Не ТипЗнч(ОбъектXDTO) = Тип("ОбъектXDTO") Тогда
		Возврат Таблица_;
	КонецЕсли; 
	
	СписокЗаписей_ = ОбъектXDTO.item;
	Если ТипЗнч(СписокЗаписей_) <> Тип("СписокXDTO") Тогда
		// Ошибка
		Возврат Таблица_;
	КонецЕсли;
	
	Для Каждого ЭлементВерхнегоУровня_ Из СписокЗаписей_ Цикл
		
		СписокПолей_ = ЭлементВерхнегоУровня_.children.item;
		
		НоваяСтрока_ = Таблица_.Добавить();
		НоваяСтрока_.OIDКлассификатораМинздрава = ПараметрыЗагрузки.ПараметрыЗапроса.OID;
		
		Для Каждого Элемент_ Из СписокПолей_ Цикл
			Если ВРег(Элемент_.key) = "NAME" Тогда
				НоваяСтрока_.Наименование = Элемент_.value;
				НоваяСтрока_.НаименованиеПолное = Элемент_.value;
			ИначеЕсли ВРег(Элемент_.key) = "OID" Тогда
				НоваяСтрока_.КодМинздрава = Элемент_.value;
			ИначеЕсли ВРег(Элемент_.key) = "TYPE" Тогда
				НоваяСтрока_.КодТипаМД = Элемент_.value;
			ИначеЕсли ВРег(Элемент_.key) = "MO_SIGN" Тогда
				Если НРег(Элемент_.value) = "да" Тогда
					НоваяСтрока_.НеобходимаПодписьМО = Истина;
				КонецЕсли;
			ИначеЕсли ВРег(Элемент_.key) = "PATIENT_INFO" Тогда
				Если стрНайти(НРег(Элемент_.value), "с указанием снилс") > 0 Тогда
					НоваяСтрока_.НеобходимСНИЛСПациента = Истина;
				КонецЕсли;
			ИначеЕсли ВРег(Элемент_.key) = "FORMAT" Тогда
				Если НРег(Элемент_.value) = "1" Тогда
					НоваяСтрока_.ФорматФайлаДляРЭМД = Перечисления.ФорматФайлаДляРЭМД.PDF;
				ИначеЕсли НРег(Элемент_.value) = "2" Тогда
					НоваяСтрока_.ФорматФайлаДляРЭМД = Перечисления.ФорматФайлаДляРЭМД.CDA;
				КонецЕсли;
			ИначеЕсли ВРег(Элемент_.key) = "IMPLEMENTATION_GUIDE" Тогда
				НоваяСтрока_.СсылкаНаРуководствоПоРеализацииСЭМД = Элемент_.value;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Таблица_;
	
КонецФункции

// Функция позвращает параметры для запроса данных классификатора из веб-сервиса
//
// Возвращаемое значение:
//   Структура   - структура с параметрами.
//
Функция ПолучитьПараметрыЗапроса() Экспорт

	Параметры_ = Новый Структура;
	Параметры_.Вставить("OID", "1.2.643.5.1.13.13.99.2.41");
	
	Возврат Параметры_

КонецФункции

#КонецОбласти

#КонецОбласти
